# Генерация датасета

## Импортирование библиотек

In [118]:
import random
import pandas as pd
from sqlalchemy import create_engine
import cx_Oracle

## Генератор случайных SQL запросов разной сложности

## Исходные данные по Базе данных

In [132]:
columns = {
    'bookings': ['book_ref', 'book_date', 'total_amount'],
    'tickets': ['ticket_no', 'book_ref', 'passenger_id', 'passenger_name', 'contact_data'],
    'flights': ['flight_id', 'flight_no', 'scheduled_departure', 'scheduled_arrival', 'departure_airport', 'arrival_airport', 'status', 'aircraft_code', 'actual_departure', 'actual_arrival'],
    'ticket_flights': ['ticket_no', 'flight_id', 'fare_conditions', 'amount'],
    'airports_data': ['airport_code', 'airport_name', 'city', 'coordinates', 'timezone'],
    'boarding_passes': ['ticket_no', 'flight_id', 'boarding_no', 'seat_no'],
    'aircrafts_data': ['aircraft_code', 'model', 'range'],
    'seats': ['aircraft_code', 'seat_no', 'fare_conditions']
}

# Словарь с данными о типах столбцов для каждой таблицы
column_types = {
    'tickets': {
        'ticket_no': 'varchar2',
        'book_ref': 'varchar2',
        'passenger_id': 'varchar2',
        'passenger_name': 'varchar2',
        'contact_data': 'varchar2'
    },
    'boarding_passes': {
        'ticket_no': 'varchar2',
        'flight_id': 'number',
        'boarding_no': 'number',
        'seat_no': 'varchar2'
    },
    'bookings': {
        'book_ref': 'varchar2',
        'book_date': 'timestamp',
        'total_amount': 'number'
    },
    'flights': {
        'flight_id': 'number',
        'flight_no': 'varchar2',
        'scheduled_departure': 'timestamp',
        'scheduled_arrival': 'timestamp',
        'departure_airport': 'varchar2',
        'arrival_airport': 'varchar2',
        'status': 'varchar2',
        'aircraft_code': 'varchar2',
        'actual_departure': 'timestamp',
        'actual_arrival': 'timestamp'
    },
    'ticket_flights': {
        'ticket_no': 'varchar2',
        'flight_id': 'number',
        'fare_conditions': 'varchar2',
        'amount': 'number'
    },
    'airports_data': {
        'airport_code': 'varchar2',
        'airport_name': 'varchar2',
        'city': 'varchar2',
        'coordinates': 'varchar2',
        'timezone': 'varchar2'
    },
    'aircrafts_data': {
        'aircraft_code': 'varchar2',
        'model': 'varchar2',
        'range': 'number'
    },
    'seats': {
        'aircraft_code': 'varchar2',
        'seat_no': 'varchar2',
        'fare_conditions': 'varchar2'
    }
}

## Генаратор простого запроса с условием WHERE

In [133]:
def random_table():
    return random.choice(list(columns.keys()))
    
def random_column(table_name, exclude_columns=[], data_type=None):
    # Начинаем с полного списка столбцов для данной таблицы
    if data_type:
        available_columns = [col for col, dtype in column_types[table_name].items() if dtype == data_type]
    else:
        available_columns = list(columns[table_name])

    # Далее исключаем столбцы из списка, если они есть в exclude_columns
    filtered_columns = [col for col in available_columns if col not in exclude_columns]

    # Возвращаем None, если отфильтрованный список пуст
    if not filtered_columns:
        return None
    
    # Выбираем случайный столбец из отфильтрованного списка
    return random.choice(filtered_columns)


def random_condition(column):
    if column in ['book_date', 'scheduled_departure', 'scheduled_arrival']:
        dates = ['2017-08-01', '2017-07-01', '2017-06-01']
        return f"{column} > DATE '{random.choice(dates)}'"
    elif column in ['total_amount']:
        return f"{column} > {random.randint(3400, 1204500)}"
    elif column in ['flight_id']:
        return f"{column} < {random.randint(1, 33120)}"
    elif column in ['boarding_no']:
        return f"{column} > {random.randint(1, 374)}"
    elif column in ['amount']:
        return f"{column} < {random.randint(3000, 203300)}"
    elif column in ['range']:
        return f"{column} > {random.randint(1200, 11100)}"
    else:
        return f"1=1"

def generate_select_query():
    table = random_table()
    col1 = random_column(table)
    col2 = random_column(table)
    condition = random_condition(col1)
    query = f"SELECT {col1}, {col2} FROM {table} WHERE {condition}"
    return query

print(generate_select_query())

SELECT aircraft_code, departure_airport FROM flights WHERE 1=1

## Генератор c сортировкой

In [134]:
def random_order_by(table):
    # Выбираем случайный столбец из доступных в таблице
    column = random.choice(columns[table])
    # Случайно выбираем направление сортировки
    order = random.choice(['ASC', 'DESC'])
    # Формируем часть запроса ORDER BY
    order_by_clause = f"ORDER BY {column} {order}"
    return order_by_clause

def generate_query_with_order_by():
    table = random_table()
    # Генерируем базовый запрос SELECT для всех столбцов таблицы
    query = f"SELECT * FROM {table} "
    # Добавляем ORDER BY часть
    order_by_clause = random_order_by(table)
    # Комбинируем запрос с ORDER BY
    full_query = query + order_by_clause
    return full_query

# Пример вызова функции
print(generate_query_with_order_by())

SELECT * FROM bookings ORDER BY book_ref DESC

## Генерация запросов с агрегацией

In [135]:
def generate_aggregate_query():
    table = random_table()
    # Выбираем случайный столбец для агрегации
    agg_col = random_column(table)
    # Выбираем другой случайный столбец для группировки
    group_by_col = random_column(table)
    while agg_col == group_by_col:
        group_by_col = random_column(table)  # Убедимся, что столбцы разные

    if column_types[table][agg_col] == 'number':
        agg_func = random.choice(['COUNT', 'AVG', 'SUM', 'MAX', 'MIN'])
    else:
        agg_func = 'COUNT'
    # Создаем запрос с агрегатной функцией и группировкой
    query = f"SELECT {group_by_col}, {agg_func}({agg_col}) FROM {table} GROUP BY {group_by_col}"
    return query

print(generate_aggregate_query())

SELECT boarding_no, MAX(flight_id) FROM boarding_passes GROUP BY boarding_no

## Генерация запросов с агрегацией и HAVING

In [136]:
def generate_aggregate_query_having():
    table = random_table()
    # Выбираем случайный столбец для агрегации
    agg_col = random_column(table)
    # Выбираем другой случайный столбец для группировки
    group_by_col = random_column(table)
    while agg_col == group_by_col:
        group_by_col = random_column(table)  # Убедимся, что столбцы разные

    if column_types[table][agg_col] == 'number':
        agg_func = random.choice(['COUNT', 'AVG', 'SUM', 'MAX', 'MIN'])
    else:
        agg_func = 'COUNT'
    # Создаем запрос с агрегатной функцией и группировкой
    query = f"SELECT {group_by_col}, {agg_func}({agg_col}) FROM {table} GROUP BY {group_by_col} HAVING {agg_func}({agg_col}) > {random.randint(1, 500)}"
    return query

print(generate_aggregate_query())

SELECT range, COUNT(aircraft_code) FROM aircrafts_data GROUP BY range

## Генерация запросов с агрегацией и с условием

In [137]:
def random_column_agg(table_name, data_type=None):
    if data_type:
        filtered_columns = [col for col, dtype in column_types[table_name].items() if dtype == data_type]
        if filtered_columns:
            return random.choice(filtered_columns)
    return random.choice(list(columns[table_name]))

def generate_aggregate_query_advanced():
    table = random_table()
    # Выбираем случайный столбец для агрегации, предпочтительно числовой
    agg_col = random_column_agg(table, data_type='number')
    # Выбираем другие столбцы для группировки, могут быть любого типа
    group_by_cols = random.sample(columns[table], random.randint(1, len(columns[table]) - 1))
    group_by_cols = [col for col in group_by_cols if col != agg_col]

    # Выбор агрегатной функции, соответствующей типу данных столбца агрегации
    if column_types[table][agg_col] == 'number':
        agg_func = random.choice(['COUNT', 'AVG', 'SUM', 'MAX', 'MIN'])
    else:
        agg_func = 'COUNT'

    # Формируем часть запроса с условием WHERE, если нужно
    where_condition = random_condition(random_column(table))

    group_by_clause = ', '.join(group_by_cols)
    query = f"SELECT {group_by_clause}, {agg_func}({agg_col}) FROM {table} WHERE {where_condition} GROUP BY {group_by_clause}"
    return query

# Пример вызова функции
print(generate_aggregate_query_advanced())

SELECT , SUM(range) FROM aircrafts_data WHERE range > 6618 GROUP BY

## Генерация запросов с JOIN

In [138]:
def compatible_columns(table1, table2):
    cols1 = set(columns[table1])
    cols2 = set(columns[table2])
    compatible = list(cols1.intersection(cols2))
    return [(col, col) for col in compatible]

def generate_join_query():
    max_attempts = 10  # Максимальное количество попыток найти подходящие столбцы
    for attempt in range(max_attempts):
        table1 = random_table()
        table2 = random_table()
        while table1 == table2:
            table2 = random_table()

        compatible_cols = compatible_columns(table1, table2)
        if compatible_cols:
            join_col1, join_col2 = random.choice(compatible_cols)
            select_col1 = random_column(table1, exclude_columns=[join_col1])
            select_col2 = random_column(table2, exclude_columns=[join_col2])
            query = f"SELECT t1.{select_col1}, t2.{select_col2} FROM {table1} t1 JOIN {table2} t2 ON t1.{join_col1} = t2.{join_col2}"
            return query
    return "Failed to find compatible columns for JOIN after several attempts"

# Пример вызова функции
print(generate_join_query())

SELECT t1.ticket_no, t2.departure_airport FROM ticket_flights t1 JOIN flights t2 ON t1.flight_id = t2.flight_id

## Генерация запросов с встроенными функциями

In [139]:
def random_function(column, table):
    # Получаем тип данных для столбца
    column_type = column_types[table][column]
    # Определение функций на основе типа данных
    if column_type == 'number':
        functions = [f"ROUND({column})"]
    elif column_type in ['varchar2', 'varchar']:
        functions = [f"LOWER({column})", f"UPPER({column})"]
    else:
        functions = []
    return random.choice(functions) if functions else None

def generate_function_query():
    table = random_table()
    column = random_column(table)
    func = random_function(column, table)
    if func:
        query = f"SELECT {func} FROM {table}"
        return query
    else:
        return "No applicable function for the selected column type"

# Пример вызова функции
print(generate_function_query())

SELECT UPPER(flight_no) FROM flights

## Генерация запросов со сложными JOIN

In [140]:
def generate_advanced_join_query():
    max_attempts = 10  # Максимальное количество попыток найти подходящие столбцы
    for attempt in range(max_attempts):
        table1 = random_table()
        table2 = random_table()
        while table1 == table2:
            table2 = random_table()
        
        compatible_cols = compatible_columns(table1, table2)
        if compatible_cols:
            join_col1, join_col2 = random.choice(compatible_cols)
            join_type = random.choice(['JOIN', 'LEFT JOIN', 'RIGHT JOIN', 'FULL OUTER JOIN'])
            
            # Выбор случайного количества столбцов для вывода в результате, исключая столбцы join
            select_cols1 = [col for col in columns[table1] if col != join_col1]
            select_cols2 = [col for col in columns[table2] if col != join_col2]
            random.shuffle(select_cols1)
            random.shuffle(select_cols2)
            select_cols1 = select_cols1[:random.randint(1, len(select_cols1))]  # Выбор 1+ столбца
            select_cols2 = select_cols2[:random.randint(1, len(select_cols2))]  # Выбор 1+ столбца
            
            select_part = ', '.join([f"t1.{col}" for col in select_cols1] + [f"t2.{col}" for col in select_cols2])
            query = f"SELECT {select_part} FROM {table1} t1 {join_type} {table2} t2 ON t1.{join_col1} = t2.{join_col2}"
            return query
    return "Failed to find compatible columns for JOIN after several attempts"

# Пример вызова функции
print(generate_advanced_join_query())

SELECT t1.passenger_name, t2.total_amount, t2.book_date FROM tickets t1 RIGHT JOIN bookings t2 ON t1.book_ref = t2.book_ref

## Подключение к базе данных Oracle и генерация в ней SQL запросов

In [141]:
def create_connection():
    dsn = cx_Oracle.makedsn('localhost', 1521, service_name='xe')  # 'xe' - это пример названия сервиса, измените его на ваше
    connection = cx_Oracle.connect('c##avia', 'qwerty', dsn)
    return connection

In [142]:
# Функция для безопасного выполнения запроса
def execute_query(query, connection):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()  # Зафиксируйте изменения, если запрос вносит их
    except cx_Oracle.DatabaseError as e:
        print(f"Query failed: {query}, Error: {e}")
    finally:
        cursor.close()

In [143]:
# Генератор случайных SQL запросов
def generate_random_query():
    functions = [generate_select_query, generate_join_query, generate_aggregate_query, generate_function_query, generate_advanced_join_query, generate_aggregate_query_advanced, generate_query_with_order_by, generate_aggregate_query_having]
    return random.choice(functions)()

In [144]:
### Шаг 2: Основная функция для выполнения запросов
def main():
    connection = create_connection()
    try:
        for _ in range(500):  # Выполнение 100 случайных запросов
            query = generate_random_query()
            execute_query(query, connection)
    finally:
        connection.close()

In [145]:
### Шаг 3: Запуск скрипта
if __name__ == "__main__":
    main()

Query failed: No applicable function for the selected column type, Error: ORA-00900: invalid SQL statement
Query failed: SELECT , MAX(total_amount) FROM bookings WHERE 1=1 GROUP BY , Error: ORA-00936: missing expression
Query failed: SELECT , MIN(flight_id) FROM boarding_passes WHERE 1=1 GROUP BY , Error: ORA-00936: missing expression
Query failed: No applicable function for the selected column type, Error: ORA-00900: invalid SQL statement
Query failed: SELECT , COUNT(flight_id) FROM ticket_flights WHERE amount < 171780 GROUP BY , Error: ORA-00936: missing expression
Query failed: No applicable function for the selected column type, Error: ORA-00900: invalid SQL statement
Query failed: SELECT , COUNT(passenger_name) FROM tickets WHERE 1=1 GROUP BY , Error: ORA-00936: missing expression
Query failed: SELECT , COUNT(flight_id) FROM ticket_flights WHERE 1=1 GROUP BY , Error: ORA-00936: missing expression
Query failed: No applicable function for the selected column type, Error: ORA-00900: invalid SQL statement
Query failed: SELECT , AVG(range) FROM aircrafts_data WHERE 1=1 GROUP BY , Error: ORA-00936: missing expression
Query failed: No applicable function for the selected column type, Error: ORA-00900: invalid SQL statement

## Получения Датасета по статистике выполнения SQL запросов

In [148]:
def create_sqlalchemy_engine():
    # Формируем строку подключения для SQLAlchemy
    dsn = 'oracle+cx_oracle://c##avia:qwerty@localhost:1521/xe'
    # Создаем объект движка
    engine = create_engine(dsn)
    return engine

def execute_query_with_sqlalchemy():
    engine = create_sqlalchemy_engine()
    query = """
    SELECT *
    FROM EXTENDED_SQL_MONITORING
    WHERE module <> 'DBMS_SCHEDULER' 
        AND ACTION IS NULL 
        AND BIND_DATA IS NULL 
        AND SQL_TEXT LIKE 'SELECT%'
    """
    try:
        # Используем метод read_sql для выполнения запроса и загрузки данных в DataFrame
        with engine.connect() as connection:
            df = pd.read_sql(query, con=connection)
        return df
    except Exception as e:
        print(f"Ошибка выполнения запроса: {e}")

# Получаем DataFrame
df = execute_query_with_sqlalchemy()
df

,sql_text,sql_fulltext,sql_id,sharable_mem,persistent_mem,runtime_mem,sorts,loaded_versions,open_versions,users_opening,...,con_id,is_reoptimizable,is_resolved_adaptive_plan,im_scans,im_scan_bytes_uncompressed,im_scan_bytes_inmemory,ddl_no_invalidate,is_rolling_invalid,is_rolling_refresh_invalid,result_cache
0,SELECT SUM(seat_no) FROM boarding_passes,SELECT SUM(seat_no) FROM boarding_passes,fsm8vq211k4mt,20313,7136,5736,0,1,0,0,...,1,N,None,0,0,0,N,N,N,N
1,"SELECT aircraft_code, MIN(fare_conditions) FRO...","SELECT aircraft_code, MIN(fare_conditions) FRO...",2matuma309v07,7341,29488,27984,0,0,1,1,...,1,N,None,0,0,0,N,N,N,N
2,SELECT /*OracleDictionaryQueries.ALL_ROLES_QUE...,SELECT /*OracleDictionaryQueries.ALL_ROLES_QUE...,bjccztvpdrdyv,35678,82800,81400,0,1,0,0,...,1,Y,Y,0,0,0,N,N,N,N
3,"SELECT t1.passenger_name, t2.boarding_no FROM ...","SELECT t1.passenger_name, t2.boarding_no FROM ...",6pbu861t6uzhn,28503,68960,67456,0,1,1,1,...,1,N,None,0,0,0,N,N,N,N
4,"SELECT t1.passenger_name, t2.boarding_no FROM ...","SELECT t1.passenger_name, t2.boarding_no FROM ...",6pbu861t6uzhn,28503,68960,67456,0,1,0,0,...,1,N,None,0,0,0,N,N,N,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1804,"SELECT boarding_no, COUNT(seat_no) FROM boardi...","SELECT boarding_no, COUNT(seat_no) FROM boardi...",csanzacm3a6z0,19473,7568,6064,0,1,0,0,...,1,N,None,0,0,0,N,N,N,N
1805,SELECT * FROM seats ORDER BY fare_conditions ASC,SELECT * FROM seats ORDER BY fare_conditions ASC,5nvnkj5mumgu0,23529,27328,25720,2,1,0,0,...,1,N,None,0,0,0,N,N,N,N
1806,SELECT * FROM aircrafts_data ORDER BY aircraft...,SELECT * FROM aircrafts_data ORDER BY aircraft...,0gtsqcykdjd9b,23521,8920,7312,0,1,0,0,...,1,N,None,0,0,0,N,N,N,N
1807,"SELECT t1.fare_conditions, t2.actual_departure...","SELECT t1.fare_conditions, t2.actual_departure...",bda8021m9pdhq,27597,48152,46648,0,1,0,0,...,1,N,None,0,0,0,N,N,N,N
1808,"SELECT t1.amount, t1.fare_conditions, t1.ticke...","SELECT t1.amount, t1.fare_conditions, t1.ticke...",7adjjgrykkpa0,31691,74344,72528,0,1,0,0,...,1,N,None,0,0,0,N,N,N,N